---
kind: enumMember
id: F:Autodesk.Revit.DB.IFC.IFCDataPrimitiveType.Enumeration
enum: Autodesk.Revit.DB.IFC.IFCDataPrimitiveType
source: html/251abe68-f18c-a4f3-f86d-15a5fa0f9f3a.htm
---
# Autodesk.Revit.DB.IFC.IFCDataPrimitiveType.Enumeration

Enumeration.
 When reading or writing an IFCData of primitive type Enumeration,
 the value will be the string representation of the enumeration value
 as seen in the IFC specification.